Основы программирования на C++

Переменные. Математические операции. Типы переменных `double` и `char`

---

### Задания на дом



##### С использованием переменных типа `double`

1. Напишите программу, которая вычисляет и выводит на экран значение $p=\frac{k \cdot n}{7} + m$, если $k$, $n$ и $m$ заданы как $k=5.867$, $n=4.25$, $m=7.1$.
2. Напишите программу, которая вычисляет и выводит на экран значение $t=(u+v) \cdot (b-7)$, если $u$, $v$ и $b$ заданы как $u=0.325$, $v=-25.0002$, $b=3.27$.



##### С использованием переменных типа `char`

3. Напишите программу, которая выводит на экран слово *"Laughs"*, используя символы (переменные типа `char`) для каждой буквы.
7. Напишите программу, которая выводит на экран коды символов `'F'` и `'f'`.



***Указание:***

Для вывода значений переменных на экран используйте команду вывода на экран `cout <<`.

