Основы программирования на C++

Считывание чисел и символов с помощью `cin >>`

---

### Задания на урок



1. Напишите программу, которая просит пользователя ввести три числа, после чего выводит на экран эти три числа.

   *Пример работы*

   ```
   Введите три числа
   5
   7.2
   11.467
   Спасибо.
   Вы ввели числа 5, 7.2 и 11.467
   ```

   

2. Напишите программу, которая просит пользователя ввести два числа, считывает их, а затем выводит на экран сумму (плюс) и разность (минус) данных двух чисел.

   *Пример работы*

   ```
   Введите первое число
   4
   Введите второе число
   7
   4 + 7 = 11
   4 - 7 = -3
   ```

   

3. Напишите программу, которая просит пользователя ввести число с клавиатуры, считывает число с клавиатуры с помощью `cin >>`, а затем выводит предыдущее перед ним и следующее после него.

   *Пример работы*

   ```
   Введите число
   15
   Предыдущее число это 14
   Следующее число это 16
   ```

   Напоминание: если есть число $a$, то предыдущее перед ним это $a-1$, а следующее после него $a+1$.

   

4. Напишите программу, которая просит пользователя ввести слово из пяти букв, считывает эти пять букв (без пробелов), после этого выводит это слово в обратном порядке следования символов (переворачивает его).

   *Пример работы*

   ```
   Введите слово из пяти букв
   Hello
   olleH
   ```

   Для хранения слова из пяти букв потребуется пять переменных типа `char`.

   

5. Напишите программу, которая просит пользователя ввести слово из пяти букв, считывает эти пять букв (без пробелов), после этого выводит это слово вертикально.

   *Пример работы*

   ```
   Введите слово из пяти букв
   Hello
   H
   e
   l
   l
   o
   ```

   

6. Напишите программу, которая просит пользователя ввести расстояние $S$ км от города до деревни, затем просит ввести скорость $v$ км/ч, с которой вы собираетесь ехать до деревни, считывает эти два значения. После этого программа подсчитывает время, за которое вы сумеете добраться до деревни, и выводит его на экран.

   *Пример работы*

   ```
   Какое расстояние от города до деревни?
   70
   С какой скоростью поедете?
   40
   Вы доедете до деревни за 1.75 часа
   ```

   

7. Напишите программу, которая просит пользователя ввести количество минут, считывает это число, после этого выводит на экран то же самое время, переведённое в часы и минуты.

   *Пример работы*

   ```
   Введите время в минутах
   215
   Это 3 часа 35 минут
   ```

   Для выполнения этого задания потребуется одна переменная типа `int`, команда `cout <<`, `cin >>`, операция деления `/` и операция взятия остатка от деления `%`.