Основы программирования на C++

Функции

---

### Задания на урок



В каждой задаче требуется написать программу, которая использует написанные вами функции.

1. Программа просит пользователя ввести три числа $a$, $b$, $c$ — длины сторон треугольника. Необходимо реализовать следующие функции:

   1. Функция получает числа $a$ , $b$, $c$ и возвращает `true`, если возможно построить треугольник с такими сторонами, иначе возвращает `false`. Построить треугольник возможно, если сумма любых двух его сторон больше третьей стороны, то есть $a+b>c$, $a+c>b$ и $b+c>a$.

      Для решения используются переменные типа `double`, операторы `if` и `&&`.

   2. Функция получает числа $a$, $b$, $c$, вычисляет и возвращает периметр $P$ треугольника по формуле $P=a+b+c$.

   3. Функция получает числа $a$, $b$, $c$ и выводит на экран тип треугольника:

      - `равносторонний`, если $a=b=c$
      - `равнобедренный`, если $a=b$ или $a=c$ или $b=c$
      - `разносторонний`, если $a \neq b \neq c$

   4. Функция получает числа $a$, $b$, $c$, вычисляет и возвращает площадь $S$ треугольника по формуле Герона $S=\sqrt{p(p-a)(p-b)(p-c)}$, где $p=\frac{a+b+c}{2}$ — половина периметра.

      Можно использовать ранее написанную функцию для вычисления периметра.

   

2. Программа просит пользователя ввести два числа $a$ и $b$ — высоту и ширину прямоугольника. Необходимо реализовать следующие функции:

   1. Функция получает числа $a$, $b$, вычисляет и возвращает периметр $P$ прямоугольника по формуле $P=(a+b) \cdot 2$.
   2. Функция получает числа $a$, $b$, вычисляет и возвращает площадь $S$ прямоугольника по формуле $S=a \cdot b$.
   3. Функция получает числа $a$, $b$ и выводит на экран тип прямоугольника:
      - `высокий`, если $a>b$
      - `широкий`, если $b>a$
      - `квадрат`, если $a=b$

   

3. Программа просит пользователя ввести два числа $p$ и $q$ — значения двух углов треугольника. Необходимо реализовать следующие функции:

   1. Функция получает углы $p$ и $q$ треугольника и возвращает значение третьего угла треугольника, вычисленное по формуле $v=180-p-q$.
   2. Функция получает углы $p$ и $q$ треугольника, с помощью предыдущей функции вычисляет значение $v$ третьего угла и выводит на экран тип треугольника:
      - равносторонний, если $p=q=v$
      - равнобедренный, если $p=q$ или $p=v$ или $q=v$
      - разносторонний, если $p \neq q \neq v$
   3. Функция получает углы $p$ и $q$ треугольника и возвращает `true`, если такой треугольник возможно построить, иначе возвращает `false`. Треугольник можно построить, если $p+q<180$.



---



*Шаблон для написания программы 1:*

```c++
#include<iostream>
using namespace std;

int main() {
    setlocale(0, "rus");
    int a = 0;
    int b = 0;
    int c = 0;
    int P = 0;
    int S = 0;
    bool good = false;
    
    cout << "Введите три числа через пробел:" << endl;
    cin >> a >> b >> c;
    
    good = good_triangle(a, b, c);
    
    if (good == true) {
        cout << "Построить треугольник можно" << endl;
        P = perimeter(a, b, c);
        S = square(a, b, c);
        
        cout << "Периметр P=" << P << endl;
	    cout << "Площадь S=" << S << endl;
        
        triangle_type(a, b, c);
    }
    else {
        cout << "Построить треугольник нельзя" << endl;
    }
    
    return 0;
}
```

Реализовать необходимо функции `good_triangle`, `perimeter`, `square` и `triangle_type`.



