Основы программирования на C++

Переменные. Математические операции. Тип переменных `int`

---

### Задания на дом



##### С использованием переменных типа `int`

1. Напишите программу, которая вычисляет и выводит на экран значение $p=\frac{k \cdot n}{2} + m$, если $k$, $n$ и $m$ заданы как $k=15$, $n=4$, $m=7$.
2. Напишите программу, которая вычисляет и выводит на экран значение $t=(u+v) \cdot (b-7)$, если $u$, $v$ и $b$ заданы как $u=0$, $v=-25$, $b=3$.



***Указание:***

Для вывода значений переменных на экран используйте команду вывода на экран `cout <<` .