Основы программирования на C++

Вывод чисел и символов на экран с помощью `cout <<`. Использование `endl`

---

### Задания на урок



1. Напишите пустую программу, которая ничего не делает.
   

   
2. Напишите программу, которая выводит на экран фразу "Hello, World!"

   

3. Напишите программу, которая выводит на экран четверостишие:

   ```
   The leaves are falling 
   One by one
   Summer's over
   School's begun
   ```

   


4. Напишите программу, которая выводит на экран фразу на русском языке "Привет, Мир!"
   

   
5. Напишите программу, которая выводит на экран стихотворение:

   ```
   One, Two I go to school
   Three, Four
   I play outdoor
   Five, Six
   I read my books
   Seven, Eight
   I am never late
   Nine, Ten
   I sleep by then.
   ```

   

6. Напишите программу, которая будет выводить ёлку из символов `*`

   ```
         *
        ***
       *****
      *******
     *********
    ***********
   *************
        ***
   ```

   

